/* tslint:disable */
export const bodyParts = `№|Название|Пол|Общая часть тела
1|Голова||
2|Глаза||
3|Нос||
4|Ротовая полость||
5|Уши||
6|Шея или горло||
7|Затылок||
8|Грудная клетка||
9|Грудь|Ж|
10|Верхняя часть живота||
11|Центральная часть живота||
12|Нижняя часть живота||
13|Плечо||
14|Предплечье||
15|Кисть||
16|Половые органы|Ж|Половые органы
17|Спина||
18|Нижняя часть спины||
19|Ягодицы||
20|Анус||
21|Бедро||
22|Колено||
23|Голень||
24|Ступня||
25|Половые ограны|М|Половые органы
26|Половые органы||
27|Нижняя часть спины|Ж|Нижняя часть спины
28|Нижняя часть спины|М|Нижняя часть спины`;

export const symptoms = `№|Название|Критичный|Часть тела|Родительский симптом
1|Утомляемость|||
2|Озноб|||Утомляемость
3|Истончение или ломкость волос||Голова|Утомляемость
4|Необъяснимое увеличение веса|||Утомляемость
5|Сухость кожи|||Утомляемость
6|Недосып|||Утомляемость
7|Бледность|||Утомляемость
8|Слабость|||Утомляемость
9|Отдышка||Грудная клетка|Утомляемость
10|Учащенное сердцебиение||Грудная клетка|Утомляемость
11|Большое употребление алкоголя|||Утомляемость
12|Неспособность сосредоточиться или принять решение|||Утомляемость
13|Снижение полового влечения||Половые органы|Утомляемость
14|Повторяющиеся головные боли||Голова|Утомляемость
15|Подавленное настроение|||Утомляемость
16|Беспрерывная напряженная работа в течение нескольких дней|||Утомляемость
17|Выздоровление после перенесенной болезни|||Утомляемость
18|Потеря в весе|||
19|Плохой аппетит||Ротовая полость|Потеря в весе
20|Усилинная потливость|||Потеря в весе
21|Слабость или дрожь|||Потеря в весе
22|Необъяснимая усталость|||Потеря в весе
23|Пучеглазие||Глаза|Потеря в весе
24|Учащенное или обильное мочеиспускание||Половые органы|Потеря в весе
25|Неутолимая жажда||Ротовая полость|Потеря в весе
26|Зуд половых органов||Половые органы|Потеря в весе
27|Отсутствие менструаций||Половые органы|Потеря в весе
28|Повторяющиеся приступы поноса|Да|Анус|Плохой аппетит
29|Повторяющиеся запоры||Анус|Плохой аппетит
30|Повторяющаяся боль в животе||Центральная часть живота|Плохой аппетит
31|Кровь в кале|Да|Анус|Плохой аппетит
32|Обильная потливость по ночам|||Плохой аппетит
33|Повторяющиеся подъемы температуры|||Плохой аппетит
34|Общее недомогание|||Плохой аппетит
35|Постоянный кашель||Ротовая полость|Плохой аппетит
36|Кровь в мокроте|Да|Ротовая полость|Плохой аппетит
37|Подавленное настроение|||Плохой аппетит
38|Нарушение сна|||Плохой аппетит
39|Снижение полового влечения|||Плохой аппетит
40|Неспособность сосредоточиться или принять решение|||Плохой аппетит
41|Зубная боль||Ротовая полость|
42|Длительная зубная боль||Ротовая полость|Зубная боль
43|Ощущение, что зуб удлинился или стал подвижным||Ротовая полость|Зубная боль
44|Повышенная температура|||Зубная боль
45|Повторяющиеся приступы пульсирующей зубной боли||Ротовая полость|Зубная боль
46|Зуб очень чувствителен к холодному и горячему||Ротовая полость|Зубная боль
47|Зубная боль держится несколько минут||Ротовая полость|Зубная боль
48|Запломбировали один или несколько зубов на протяжении последних недель||Ротовая полость|Зубная боль
49|Зуб болит, только при нажатии||Ротовая полость|Запломбировали один или несколько зубов на протяжении последних недель
50|Боль появляется, только когда вы едите что-нибудь холодное или сладкое, и проходит через несколько секунд||Ротовая полость|Зубная боль
51|Боль при нажатии||Ротовая полость|Зубная боль
52|Раздражение и боль в глазе||Глаза|
53|Повредили глаз|Да|Глаза|Раздражение и боль в глазе
54|В глаз попало инородное тело, например песчинка||Глаза|Раздражение и боль в глазе
55|Затуманенность зрения и/или радужные круги вокруг источника цвета|Да|Глаза|Раздражение и боль в глазе
56|Покраснение склеры глаза||Глаза|Раздражение и боль в глазе
57|Слизисто-гнойные выделения из глаза||Глаза|Покраснение склеры глаза
58|Веко загнулось внутрь||Глаза|Покраснение склеры глаза
59|Ощущение болезненности в глазу|Да|Глаза|Покраснение склеры глаза
60|Слезится глаз||Глаза|Покраснение склеры глаза
61|Веки покраснели и зудят||Глаза|Раздражение и боль в глазе
62|Покрасневшая припухлость на веке||Глаза|Раздражение и боль в глазе
63|Боль в руке||Плечо|
64|Боль в руке||Предплечье|
65|Боль в руке||Кисть|
66|Боль возникла сразу же после травмы, падения или резкого движения||Плечо|Боль в руке
67|Невозможность двигать рукой или боль остается сильной даже в покое|Да|Плечо|Боль возникла сразу же после травмы, падения или резкого движения
68|Боль локализуется в основном в верхней части руки и появляется только при определенном движении||Плечо|Боль в руке
69|Боль распространяется вниз по всей руке||Плечо|Боль в руке
70|Боль возникла сразу же после травмы, падения или резкого движения||Предплечье|Боль в руке
71|Боль возникла сразу же после травмы, падения или резкого движения||Кисть|Боль в руке
72|Невозможность двигать рукой или боль остается сильной даже в покое|Да|Предплечье|Боль в руке
73|Невозможность двигать рукой или боль остается сильной даже в покое|Да|Кисть|Боль в руке
74|Онемение и покалывание в руке, особенно по ночам||Плечо|Боль в руке
75|Онемение и покалывание в руке, особенно по ночам||Предплечье|Боль в руке
76|Онемение и покалывание в руке, особенно по ночам||Кисть|Боль в руке
77|Боль в основном сосредоточена в плечевых и локтевых суставах ||Плечо|Боль в руке
78|Боль в основном сосредоточена в мелких суставах пальцев рук||Кисть|Боль в руке
79|Боль в ноге||Бедро|
80|Боль в ноге||Голень|
81|Боль в ноге||Ступня|
82|Боль возникла сразу же после травмы, падения или резкого движения||Бедро|Боль в ноге
83|Боль возникла сразу же после травмы, падения или резкого движения||Голень|Боль в ноге
84|Боль возникла сразу же после травмы, падения или резкого движения||Ступня|Боль в ноге
85|Невозможность двигать ногой или боль остается сильной даже в покое|Да|Бедро|Боль возникла сразу же после травмы, падения или резкого движения
86|Невозможность двигать ногой или боль остается сильной даже в покое|Да|Голень|Боль возникла сразу же после травмы, падения или резкого движения
87|Невозможность двигать ногой или боль остается сильной даже в покое|Да|Ступня|Боль возникла сразу же после травмы, падения или резкого движения
88|Боль ограничивается областью голеностопного сустава||Ступня|Боль в ноге
89|Боль ограничивается областью тазобедренного сустава||Бедро|Боль в ноге
90|Внезапная спазматическая боль в икроножной мышце||Голень|Боль в ноге
91|Боль появляется регулярно во время физической нагрузки и исчезает в покое||Голень|Внезапная спазматическая боль в икроножной мышце
92|Боль возникла через несколько часов после необычно сильной физической нагрузки||Бедро|Боль в ноге
93|Боль возникла через несколько часов после необычно сильной физической нагрузки||Голень|Боль в ноге
94|Боль возникла через несколько часов после необычно сильной физической нагрузки||Ступня|Боль в ноге
95|Небольшой  участок на голени покраснел и стал болезненным||Голень|Боль в ноге
96|Болезненна и отечна область икры|Да|Голень|Боль в ноге
97|Боль в животе||Верхняя часть живота|
98|Боль в животе||Центральная часть живота|
99|Боль в животе||Нижняя часть живота|
100|Приступы боли в течении нескольких дней за последнюю неделю||Верхняя часть живота|Боль в животе
101|Приступы боли в течении нескольких дней за последнюю неделю||Центральная часть живота|Боль в животе
102|Приступы боли в течении нескольких дней за последнюю неделю||Нижняя часть живота|Боль в животе
103|Сильная боль в животе продолжается более часа||Верхняя часть живота|Боль в животе
104|Сильная боль в животе продолжается более часа||Центральная часть живота|Боль в животе
105|Сильная боль в животе продолжается более часа||Нижняя часть живота|Боль в животе
106|Рвота, не снявшая боль|Да|Верхняя часть живота|Сильная боль в животе продолжается более часа
107|Рвота, не снявшая боль|Да|Центральная часть живота|Сильная боль в животе продолжается более часа
108|Рвота, не снявшая боль|Да|Нижняя часть живота|Сильная боль в животе продолжается более часа
109|Болезненный вздутый живот|Да|Верхняя часть живота|Сильная боль в животе продолжается более часа
110|Болезненный вздутый живот|Да|Центральная часть живота|Сильная боль в животе продолжается более часа
111|Болезненный вздутый живот|Да|Нижняя часть живота|Сильная боль в животе продолжается более часа
112|Понос||Верхняя часть живота|Боль в животе
113|Понос||Центральная часть живота|Боль в животе
114|Понос||Нижняя часть живота|Боль в животе
115|Боль началась в пояснице и переместилась в пах||Половые органы|Боль в животе
116|Боль локализуется в основном ниже талии||Нижняя часть живота|Боль в животе
117|Может ли у вас быть беременность сроком до 3 месяцев|Да|Нижняя часть спины|Боль локализуется в основном ниже талии
118|Кровотечения из влагалища|Да|Нижняя часть спины|Боль локализуется в основном ниже талии
119|Периодические схваткообразные боли||Нижняя часть спины|Боль локализуется в основном ниже талии
120|Периодические схваткообразные боли||Нижняя часть спины|Может ли у вас быть беременность сроком до 3 месяцев
121|Периодические схваткообразные боли||Нижняя часть спины|Кровотечения из влагалища
122|Менструация||Половые органы|Периодические схваткообразные боли
123|Менструация||Половые органы|Периодические схваткообразные боли
124|Выделения из влагалища с неприятным запахом||Половые органы|Боль локализуется в основном ниже талии
125|Жжение при мочеиспускании или вы мочитесь чаще обычного||Половые ограны|Периодические схваткообразные боли
126|Жжение при мочеиспускании или вы мочитесь чаще обычного||Половые органы|Может ли у вас быть беременность сроком до 3 месяцев
127|Жжение при мочеиспускании или вы мочитесь чаще обычного||Половые органы|Кровотечения из влагалища
128|Боль распространяется в области правого подреберья||Нижняя часть живота|Боль в животе
129|Тупая сжимающая боль распространяется вверх по грудной клетке и вниз вдоль рук||Центральная часть живота|Боль в животе`;

export function parseData(dataString: string): string[][] {
	return dataString.split('\n').map((row) => row.split('|'));
}
